In [4]:
!pip install mysqlclient

Requirement already satisfied: mysqlclient in /usr/local/lib/python3.10/dist-packages (2.2.0)

In [2]:
%load_ext sql
%sql mysql://A04:A04password@testproject.mysql.database.azure.com:3306/A04

In [3]:
%%sql
SHOW DATABASES

 * mysql://A04:***@testproject.mysql.database.azure.com:3306/A04
3 rows affected.

[('a04',), ('information_schema',), ('performance_schema',)]

In [4]:
%%sql
USE a04

 * mysql://A04:***@testproject.mysql.database.azure.com:3306/A04
0 rows affected.

[]

In [5]:
%%sql
SHOW TABLES

 * mysql://A04:***@testproject.mysql.database.azure.com:3306/A04
20 rows affected.

[('ambience',),
 ('attributes',),
 ('bestnights',),
 ('business',),
 ('business_df',),
 ('businessparking',),
 ('categories',),
 ('checkin',),
 ('checkin_df',),
 ('dietaryrestrictions',),
 ('goodformeal',),
 ('hairspecializesin',),
 ('hours',),
 ('music',),
 ('review',),
 ('review_df',),
 ('tip_df',),
 ('tips',),
 ('user_df',),
 ('users',)]

In [ ]:
%%sql
ALTER TABLE a04.attributes
ADD By_Appointment_Only BOOLEAN;

In [6]:
%%sql
UPDATE a04.attributes
SET By_Appointment_Only = CASE
  WHEN ByAppointmentOnly = 'True' THEN TRUE
  ELSE FALSE
END;

 * mysql://A04:***@testproject.mysql.database.azure.com:3306/A04
150346 rows affected.

[]

In [10]:
%%sql
ALTER TABLE a04.attributes
DROP COLUMN ByAppointmentOnly;

 * mysql://A04:***@testproject.mysql.database.azure.com:3306/A04
0 rows affected.

[]

In [13]:
%%sql
ALTER TABLE a04.attributes
ADD Business_Accepts_Credit_Cards BOOLEAN;

 * mysql://A04:***@testproject.mysql.database.azure.com:3306/A04
0 rows affected.

[]

In [14]:
%%sql
UPDATE a04.attributes
SET Business_Accepts_Credit_Cards = CASE
  WHEN BusinessAcceptsCreditCards = 'True' THEN TRUE
  ELSE FALSE
END;

 * mysql://A04:***@testproject.mysql.database.azure.com:3306/A04
150346 rows affected.

[]

In [16]:
%%sql
ALTER TABLE a04.attributes
DROP COLUMN BusinessAcceptsCreditCards;

 * mysql://A04:***@testproject.mysql.database.azure.com:3306/A04
0 rows affected.

[]

In [18]:
%%sql
ALTER TABLE a04.attributes
ADD Bike_Parking BOOLEAN;

 * mysql://A04:***@testproject.mysql.database.azure.com:3306/A04
0 rows affected.

[]

In [19]:
%%sql
UPDATE a04.attributes
SET Bike_Parking = CASE
  WHEN BikeParking = 'True' THEN TRUE
  ELSE FALSE
END;

 * mysql://A04:***@testproject.mysql.database.azure.com:3306/A04
150346 rows affected.

[]

In [20]:
%%sql
ALTER TABLE a04.attributes
DROP COLUMN BikeParking;

 * mysql://A04:***@testproject.mysql.database.azure.com:3306/A04
0 rows affected.

[]

In [24]:
%%sql
ALTER TABLE a04.attributes
ADD RestaurantsPriceRange TINYINT;

 * mysql://A04:***@testproject.mysql.database.azure.com:3306/A04
0 rows affected.

[]

In [29]:
%%sql
UPDATE a04.attributes
SET RestaurantsPriceRange = CASE
  WHEN RestaurantsPriceRange2 = '1' THEN 1
  WHEN RestaurantsPriceRange2 = '2' THEN 2
  WHEN RestaurantsPriceRange2 = '3' THEN 3
  WHEN RestaurantsPriceRange2 = '4' THEN 4
  WHEN RestaurantsPriceRange2 = '0' THEN 0
  ELSE 0
END;

 * mysql://A04:***@testproject.mysql.database.azure.com:3306/A04
150346 rows affected.

[]

In [30]:
%%sql
ALTER TABLE a04.attributes
DROP COLUMN RestaurantsPriceRange2;

 * mysql://A04:***@testproject.mysql.database.azure.com:3306/A04
0 rows affected.

[]

In [34]:
%%sql
ALTER TABLE a04.attributes
ADD Coat_Check BOOLEAN;

 * mysql://A04:***@testproject.mysql.database.azure.com:3306/A04
0 rows affected.

[]

In [35]:
%%sql
UPDATE a04.attributes
SET Coat_Check = CASE
  WHEN CoatCheck = 'True' THEN TRUE
  ELSE FALSE
END;

 * mysql://A04:***@testproject.mysql.database.azure.com:3306/A04
150346 rows affected.

[]

In [36]:
%%sql
ALTER TABLE a04.attributes
DROP COLUMN CoatCheck;

 * mysql://A04:***@testproject.mysql.database.azure.com:3306/A04
0 rows affected.

[]

In [38]:
%%sql
ALTER TABLE a04.attributes
ADD Restaurants_TakeOut BOOLEAN;

 * mysql://A04:***@testproject.mysql.database.azure.com:3306/A04
0 rows affected.

[]

In [39]:
%%sql
UPDATE a04.attributes
SET Restaurants_TakeOut = CASE
  WHEN RestaurantsTakeOut = 'True' THEN TRUE
  ELSE FALSE
END;

 * mysql://A04:***@testproject.mysql.database.azure.com:3306/A04
150346 rows affected.

[]

In [40]:
%%sql
ALTER TABLE a04.attributes
DROP COLUMN RestaurantsTakeOut;

 * mysql://A04:***@testproject.mysql.database.azure.com:3306/A04
0 rows affected.

[]

In [42]:
%%sql
ALTER TABLE a04.attributes
ADD Restaurants_Delivery BOOLEAN;

 * mysql://A04:***@testproject.mysql.database.azure.com:3306/A04
0 rows affected.

[]

In [43]:
%%sql
UPDATE a04.attributes
SET Restaurants_Delivery = CASE
  WHEN RestaurantsDelivery = 'True' THEN TRUE
  ELSE FALSE
END;

 * mysql://A04:***@testproject.mysql.database.azure.com:3306/A04
150346 rows affected.

[]

In [44]:
%%sql
ALTER TABLE a04.attributes
DROP COLUMN RestaurantsDelivery;

 * mysql://A04:***@testproject.mysql.database.azure.com:3306/A04
0 rows affected.

[]

In [46]:
%%sql
ALTER TABLE a04.attributes
ADD Cater BOOLEAN;

 * mysql://A04:***@testproject.mysql.database.azure.com:3306/A04
0 rows affected.

[]

In [47]:
%%sql
UPDATE a04.attributes
SET Cater = CASE
  WHEN Caters = 'True' THEN TRUE
  ELSE FALSE
END;

 * mysql://A04:***@testproject.mysql.database.azure.com:3306/A04
150346 rows affected.

[]

In [48]:
%%sql
ALTER TABLE a04.attributes
DROP COLUMN Caters;

 * mysql://A04:***@testproject.mysql.database.azure.com:3306/A04
0 rows affected.

[]

In [50]:
%%sql
ALTER TABLE a04.attributes
ADD Wheelchair_Accessible BOOLEAN;

 * mysql://A04:***@testproject.mysql.database.azure.com:3306/A04
0 rows affected.

[]

In [51]:
%%sql
UPDATE a04.attributes
SET Wheelchair_Accessible = CASE
  WHEN WheelchairAccessible = 'True' THEN TRUE
  ELSE FALSE
END;

 * mysql://A04:***@testproject.mysql.database.azure.com:3306/A04
150346 rows affected.

[]

In [52]:
%%sql
ALTER TABLE a04.attributes
DROP COLUMN WheelchairAccessible;

 * mysql://A04:***@testproject.mysql.database.azure.com:3306/A04
0 rows affected.

[]

In [54]:
%%sql
ALTER TABLE a04.attributes
ADD Happy_Hour BOOLEAN;

 * mysql://A04:***@testproject.mysql.database.azure.com:3306/A04
0 rows affected.

[]

In [55]:
%%sql
UPDATE a04.attributes
SET Happy_Hour = CASE
  WHEN HappyHour = 'True' THEN TRUE
  ELSE FALSE
END;

 * mysql://A04:***@testproject.mysql.database.azure.com:3306/A04
150346 rows affected.

[]

In [56]:
%%sql
ALTER TABLE a04.attributes
DROP COLUMN HappyHour;

 * mysql://A04:***@testproject.mysql.database.azure.com:3306/A04
0 rows affected.

[]

In [59]:
%%sql
ALTER TABLE a04.attributes
ADD Outdoor_Seating BOOLEAN;

 * mysql://A04:***@testproject.mysql.database.azure.com:3306/A04
0 rows affected.

[]

In [60]:
%%sql
UPDATE a04.attributes
SET Outdoor_Seating = CASE
  WHEN OutdoorSeating = 'True' THEN TRUE
  ELSE FALSE
END;

 * mysql://A04:***@testproject.mysql.database.azure.com:3306/A04
150346 rows affected.

[]

In [61]:
%%sql
ALTER TABLE a04.attributes
DROP COLUMN OutdoorSeating;

 * mysql://A04:***@testproject.mysql.database.azure.com:3306/A04
0 rows affected.

[]

In [63]:
%%sql
ALTER TABLE a04.attributes
ADD Has_TV BOOLEAN;

 * mysql://A04:***@testproject.mysql.database.azure.com:3306/A04
0 rows affected.

[]

In [64]:
%%sql
UPDATE a04.attributes
SET Has_TV = CASE
  WHEN HasTV = 'True' THEN TRUE
  ELSE FALSE
END;

 * mysql://A04:***@testproject.mysql.database.azure.com:3306/A04
150346 rows affected.

[]

In [65]:
%%sql
ALTER TABLE a04.attributes
DROP COLUMN HasTV;

 * mysql://A04:***@testproject.mysql.database.azure.com:3306/A04
0 rows affected.

[]

In [67]:
%%sql
ALTER TABLE a04.attributes
ADD Restaurants_Reservations BOOLEAN;

 * mysql://A04:***@testproject.mysql.database.azure.com:3306/A04
0 rows affected.

[]

In [68]:
%%sql
UPDATE a04.attributes
SET Restaurants_Reservations = CASE
  WHEN RestaurantsReservations = 'True' THEN TRUE
  ELSE FALSE
END;

 * mysql://A04:***@testproject.mysql.database.azure.com:3306/A04
150346 rows affected.

[]

In [69]:
%%sql
ALTER TABLE a04.attributes
DROP COLUMN RestaurantsReservations;

 * mysql://A04:***@testproject.mysql.database.azure.com:3306/A04
0 rows affected.

[]

In [71]:
%%sql
ALTER TABLE a04.attributes
ADD Dogs_Allowed BOOLEAN;

 * mysql://A04:***@testproject.mysql.database.azure.com:3306/A04
0 rows affected.

[]

In [72]:
%%sql
UPDATE a04.attributes
SET Dogs_Allowed = CASE
  WHEN DogsAllowed = 'True' THEN TRUE
  ELSE FALSE
END;

 * mysql://A04:***@testproject.mysql.database.azure.com:3306/A04
150346 rows affected.

[]

In [73]:
%%sql
ALTER TABLE a04.attributes
DROP COLUMN DogsAllowed;

 * mysql://A04:***@testproject.mysql.database.azure.com:3306/A04
0 rows affected.

[]

In [75]:
%%sql
ALTER TABLE a04.attributes
ADD Good_For_Kids BOOLEAN;

 * mysql://A04:***@testproject.mysql.database.azure.com:3306/A04
0 rows affected.

[]

In [76]:
%%sql
UPDATE a04.attributes
SET Good_For_Kids = CASE
  WHEN GoodForKids = 'True' THEN TRUE
  ELSE FALSE
END;

 * mysql://A04:***@testproject.mysql.database.azure.com:3306/A04
150346 rows affected.

[]

In [77]:
%%sql
ALTER TABLE a04.attributes
DROP COLUMN GoodForKids;

 * mysql://A04:***@testproject.mysql.database.azure.com:3306/A04
0 rows affected.

[]

In [78]:
%%sql
ALTER TABLE a04.attributes
ADD Restaurants_Table_Service BOOLEAN;

 * mysql://A04:***@testproject.mysql.database.azure.com:3306/A04
0 rows affected.

[]

In [79]:
%%sql
UPDATE a04.attributes
SET Restaurants_Table_Service = CASE
  WHEN RestaurantsTableService = 'True' THEN TRUE
  ELSE FALSE
END;

 * mysql://A04:***@testproject.mysql.database.azure.com:3306/A04
150346 rows affected.

[]

In [80]:
%%sql
ALTER TABLE a04.attributes
DROP COLUMN RestaurantsTableService;

 * mysql://A04:***@testproject.mysql.database.azure.com:3306/A04
0 rows affected.

[]

In [86]:
%%sql
ALTER TABLE a04.attributes
ADD Restaurants_Good_For_Groups BOOLEAN;

 * mysql://A04:***@testproject.mysql.database.azure.com:3306/A04
(MySQLdb.OperationalError) (1060, "Duplicate column name 'Restaurants_Good_For_Groups'")
[SQL: ALTER TABLE a04.attributes
ADD Restaurants_Good_For_Groups BOOLEAN;]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [83]:
%%sql
UPDATE a04.attributes
SET Restaurants_Good_For_Groups = CASE
  WHEN RestaurantsGoodForGroups = 'True' THEN TRUE
  ELSE FALSE
END;

 * mysql://A04:***@testproject.mysql.database.azure.com:3306/A04
150346 rows affected.

[]

In [84]:
%%sql
ALTER TABLE a04.attributes
DROP COLUMN RestaurantsGoodForGroups;

 * mysql://A04:***@testproject.mysql.database.azure.com:3306/A04
0 rows affected.

[]

In [88]:
%%sql
ALTER TABLE a04.attributes
ADD Drive_Thru BOOLEAN;

 * mysql://A04:***@testproject.mysql.database.azure.com:3306/A04
0 rows affected.

[]

In [89]:
%%sql
UPDATE a04.attributes
SET Drive_Thru = CASE
  WHEN DriveThru = 'True' THEN TRUE
  ELSE FALSE
END;

 * mysql://A04:***@testproject.mysql.database.azure.com:3306/A04
150346 rows affected.

[]

In [90]:
%%sql
ALTER TABLE a04.attributes
DROP COLUMN DriveThru;

 * mysql://A04:***@testproject.mysql.database.azure.com:3306/A04
0 rows affected.

[]

In [92]:
%%sql
ALTER TABLE a04.attributes
ADD Business_Accepts_Bitcoin BOOLEAN;

 * mysql://A04:***@testproject.mysql.database.azure.com:3306/A04
0 rows affected.

[]

In [93]:
%%sql
UPDATE a04.attributes
SET Business_Accepts_Bitcoin = CASE
  WHEN BusinessAcceptsBitcoin = 'True' THEN TRUE
  ELSE FALSE
END;

 * mysql://A04:***@testproject.mysql.database.azure.com:3306/A04
150346 rows affected.

[]

In [94]:
%%sql
ALTER TABLE a04.attributes
DROP COLUMN BusinessAcceptsBitcoin;

 * mysql://A04:***@testproject.mysql.database.azure.com:3306/A04
0 rows affected.

[]

In [96]:
%%sql
ALTER TABLE a04.attributes
ADD Good_For_Dancing BOOLEAN;

 * mysql://A04:***@testproject.mysql.database.azure.com:3306/A04
0 rows affected.

[]

In [97]:
%%sql
UPDATE a04.attributes
SET Good_For_Dancing = CASE
  WHEN GoodForDancing = 'True' THEN TRUE
  ELSE FALSE
END;

 * mysql://A04:***@testproject.mysql.database.azure.com:3306/A04
150346 rows affected.

[]

In [98]:
%%sql
ALTER TABLE a04.attributes
DROP COLUMN GoodForDancing;

 * mysql://A04:***@testproject.mysql.database.azure.com:3306/A04
0 rows affected.

[]

In [100]:
%%sql
ALTER TABLE a04.attributes
ADD Accepts_Insurance BOOLEAN;

 * mysql://A04:***@testproject.mysql.database.azure.com:3306/A04
0 rows affected.

[]

In [101]:
%%sql
UPDATE a04.attributes
SET Accepts_Insurance = CASE
  WHEN AcceptsInsurance = 'True' THEN TRUE
  ELSE FALSE
END;

 * mysql://A04:***@testproject.mysql.database.azure.com:3306/A04
150346 rows affected.

[]

In [102]:
%%sql
ALTER TABLE a04.attributes
DROP COLUMN AcceptsInsurance;

 * mysql://A04:***@testproject.mysql.database.azure.com:3306/A04
0 rows affected.

[]

In [104]:
%%sql
ALTER TABLE a04.attributes
ADD BYOB_ BOOLEAN;

 * mysql://A04:***@testproject.mysql.database.azure.com:3306/A04
0 rows affected.

[]

In [105]:
%%sql
UPDATE a04.attributes
SET BYOB_ = CASE
  WHEN BYOB = 'True' THEN TRUE
  ELSE FALSE
END;

 * mysql://A04:***@testproject.mysql.database.azure.com:3306/A04
150346 rows affected.

[]

In [106]:
%%sql
ALTER TABLE a04.attributes
DROP COLUMN BYOB;

 * mysql://A04:***@testproject.mysql.database.azure.com:3306/A04
0 rows affected.

[]

In [108]:
%%sql
ALTER TABLE a04.attributes
ADD Corkage_ BOOLEAN;

 * mysql://A04:***@testproject.mysql.database.azure.com:3306/A04
0 rows affected.

[]

In [109]:
%%sql
UPDATE a04.attributes
SET Corkage_ = CASE
  WHEN Corkage = 'True' THEN TRUE
  ELSE FALSE
END;

 * mysql://A04:***@testproject.mysql.database.azure.com:3306/A04
150346 rows affected.

[]

In [110]:
%%sql
ALTER TABLE a04.attributes
DROP COLUMN Corkage;

 * mysql://A04:***@testproject.mysql.database.azure.com:3306/A04
0 rows affected.

[]

In [113]:
%%sql
ALTER TABLE a04.attributes
ADD Open_24_Hours BOOLEAN;

 * mysql://A04:***@testproject.mysql.database.azure.com:3306/A04
0 rows affected.

[]

In [114]:
%%sql
UPDATE a04.attributes
SET Open_24_Hours = CASE
  WHEN Open24Hours = 'True' THEN TRUE
  ELSE FALSE
END;

 * mysql://A04:***@testproject.mysql.database.azure.com:3306/A04
150346 rows affected.

[]

In [115]:
%%sql
ALTER TABLE a04.attributes
DROP COLUMN Open24Hours;

 * mysql://A04:***@testproject.mysql.database.azure.com:3306/A04
0 rows affected.

[]

In [117]:
%%sql
ALTER TABLE a04.attributes
ADD Restaurants_Counter_Service BOOLEAN;

 * mysql://A04:***@testproject.mysql.database.azure.com:3306/A04
0 rows affected.

[]

In [118]:
%%sql
UPDATE a04.attributes
SET Restaurants_Counter_Service = CASE
  WHEN RestaurantsCounterService = 'True' THEN TRUE
  ELSE FALSE
END;

 * mysql://A04:***@testproject.mysql.database.azure.com:3306/A04
150346 rows affected.

[]

In [119]:
%%sql
ALTER TABLE a04.attributes
DROP COLUMN RestaurantsCounterService;

 * mysql://A04:***@testproject.mysql.database.azure.com:3306/A04
0 rows affected.

[]

In [122]:
%%sql
ALTER TABLE a04.attributes
ADD Wi_Fi VARCHAR(15);

 * mysql://A04:***@testproject.mysql.database.azure.com:3306/A04
0 rows affected.

[]

In [125]:
%%sql
UPDATE a04.attributes
SET Wi_Fi = CASE
  WHEN WiFi = "u'no'" THEN 'No'
  WHEN WiFi = "u'free'" THEN 'Free'
  WHEN WiFi = "free'" THEN 'Free'
  WHEN WiFi = "no" THEN 'No'
  WHEN WiFi = "u'paid'" THEN 'Paid'
  WHEN WiFi = "paid" THEN 'Paid'
  ELSE 'No'
END;

 * mysql://A04:***@testproject.mysql.database.azure.com:3306/A04
150346 rows affected.

[]

In [126]:
%%sql
ALTER TABLE a04.attributes
DROP COLUMN WiFi;

 * mysql://A04:***@testproject.mysql.database.azure.com:3306/A04
0 rows affected.

[]

In [129]:
%%sql
ALTER TABLE a04.attributes
ADD Alcohol_ VARCHAR(15);

 * mysql://A04:***@testproject.mysql.database.azure.com:3306/A04
0 rows affected.

[]

In [132]:
%%sql
UPDATE a04.attributes
SET Alcohol_ = CASE
  WHEN Alcohol = "full_bar" THEN 'Full Bar'
  WHEN Alcohol = "u'full_bar'" THEN 'Full Bar'
  WHEN Alcohol = "u'beer_and_wine'" THEN 'Beer and Wine'
  WHEN Alcohol = "beer_and_wine" THEN 'Beer and Wine'
  ELSE 'None'
END;

 * mysql://A04:***@testproject.mysql.database.azure.com:3306/A04
150346 rows affected.

[]

In [137]:
%%sql
ALTER TABLE a04.attributes
DROP COLUMN Alcohol;

 * mysql://A04:***@testproject.mysql.database.azure.com:3306/A04
0 rows affected.

[]

In [148]:
%%sql
ALTER TABLE a04.attributes
ADD Restaurants_Attire VARCHAR(15);

 * mysql://A04:***@testproject.mysql.database.azure.com:3306/A04
(MySQLdb.OperationalError) (1060, "Duplicate column name 'Restaurants_Attire'")
[SQL: ALTER TABLE a04.attributes
ADD Restaurants_Attire VARCHAR(15);]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [142]:
%%sql
UPDATE a04.attributes
SET Restaurants_Attire = CASE
  WHEN RestaurantsAttire = "u'formal'" THEN 'Formal'
  WHEN RestaurantsAttire = "'formal'" THEN 'Formal'
  WHEN RestaurantsAttire = "'dressy'" THEN 'Dressy'
  WHEN RestaurantsAttire = "u'dressy'" THEN 'Dressy'
  ELSE 'Casual'
END;

 * mysql://A04:***@testproject.mysql.database.azure.com:3306/A04
150346 rows affected.

[]

In [145]:
%%sql
ALTER TABLE a04.attributes
DROP COLUMN RestaurantsAttire;

 * mysql://A04:***@testproject.mysql.database.azure.com:3306/A04
0 rows affected.

[]

In [149]:
%%sql
ALTER TABLE a04.attributes
ADD Noise_Level VARCHAR(15);

 * mysql://A04:***@testproject.mysql.database.azure.com:3306/A04
0 rows affected.

[]

In [150]:
%%sql
UPDATE a04.attributes
SET Noise_Level = CASE
  WHEN NoiseLevel = "u'quiet'" THEN 'Quiet'
  WHEN NoiseLevel = "'quiet'" THEN 'Quiet'
  WHEN NoiseLevel = "'loud'" THEN 'Loud'
  WHEN NoiseLevel = "u'loud'" THEN 'Loud'
  WHEN NoiseLevel = "u'very_loud'" THEN 'Very Loud'
  WHEN NoiseLevel = "'very_loud'" THEN 'Very Loud'
  ELSE 'Average'
END;

 * mysql://A04:***@testproject.mysql.database.azure.com:3306/A04
150346 rows affected.

[]

In [152]:
%%sql
ALTER TABLE a04.attributes
DROP COLUMN NoiseLevel;

 * mysql://A04:***@testproject.mysql.database.azure.com:3306/A04
0 rows affected.

[]

In [155]:
%%sql
ALTER TABLE a04.attributes
ADD Smoking_ VARCHAR(15);

 * mysql://A04:***@testproject.mysql.database.azure.com:3306/A04
0 rows affected.

[]

In [156]:
%%sql
UPDATE a04.attributes
SET Smoking_ = CASE
  WHEN Smoking = "u'outdoor'" THEN 'Outdoor'
  WHEN Smoking = "outdoor" THEN 'Outdoor'
  WHEN Smoking = "u'yes'" THEN 'Yes'
  ELSE 'No'
END;

 * mysql://A04:***@testproject.mysql.database.azure.com:3306/A04
150346 rows affected.

[]

In [159]:
%%sql
ALTER TABLE a04.attributes
DROP COLUMN Smoking;

 * mysql://A04:***@testproject.mysql.database.azure.com:3306/A04
0 rows affected.

[]

In [162]:
%%sql
ALTER TABLE a04.attributes
ADD BYOB_Corkage VARCHAR(15);

 * mysql://A04:***@testproject.mysql.database.azure.com:3306/A04
0 rows affected.

[]

In [163]:
%%sql
UPDATE a04.attributes
SET BYOB_Corkage = CASE
  WHEN BYOBCorkage = "yes_free" THEN 'Free'
  WHEN BYOBCorkage = "u'yes_free'" THEN 'Free'
  WHEN BYOBCorkage = "yes_corkage" THEN 'Corkage'
  WHEN BYOBCorkage = "u'yes_corkage'" THEN 'Corkage'
  ELSE 'No'
END;

 * mysql://A04:***@testproject.mysql.database.azure.com:3306/A04
150346 rows affected.

[]

In [165]:
%%sql
ALTER TABLE a04.attributes
DROP COLUMN BYOBCorkage;

 * mysql://A04:***@testproject.mysql.database.azure.com:3306/A04
0 rows affected.

[]

In [168]:
%%sql
ALTER TABLE a04.attributes
ADD Ages_Allowed VARCHAR(15);

 * mysql://A04:***@testproject.mysql.database.azure.com:3306/A04
0 rows affected.

[]

In [169]:
%%sql
UPDATE a04.attributes
SET Ages_Allowed = CASE
  WHEN AgesAllowed = "u'21plus'" THEN '21+'
  WHEN AgesAllowed = "u'18plus'" THEN '18+'
  ELSE 'All Ages'
END;

 * mysql://A04:***@testproject.mysql.database.azure.com:3306/A04
150346 rows affected.

[]

In [171]:
%%sql
ALTER TABLE a04.attributes
DROP COLUMN AgesAllowed;

 * mysql://A04:***@testproject.mysql.database.azure.com:3306/A04
0 rows affected.

[]

In [172]:
%%sql
select * from  a04.attributes limit 1

 * mysql://A04:***@testproject.mysql.database.azure.com:3306/A04
1 rows affected.

[(0, None, None, None, None, None, None, None, 'Pns2l4eNsfO8kk83dixA6A', 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 'No', 'None', 'Casual', 'Average', 'No', 'No', 'All Ages')]

In [177]:
%%sql
ALTER TABLE a04.business
DROP PRIMARY KEY,
DROP COLUMN my_row_id,
MODIFY COLUMN business_id varchar(22) NOT NULL,
ADD PRIMARY KEY(business_id);

 * mysql://A04:***@testproject.mysql.database.azure.com:3306/A04
150346 rows affected.

[]

In [178]:
%%sql
ALTER TABLE a04.hours
DROP PRIMARY KEY,
DROP COLUMN my_row_id,
MODIFY COLUMN business_id varchar(22) NOT NULL,
ADD PRIMARY KEY(business_id);

 * mysql://A04:***@testproject.mysql.database.azure.com:3306/A04
150346 rows affected.

[]

In [ ]:
%%sql
ALTER TABLE a04.users
DROP PRIMARY KEY,
DROP COLUMN my_row_id,
MODIFY COLUMN user_id varchar(22) NOT NULL,
ADD PRIMARY KEY(user_id);

 * mysql://A04:***@testproject.mysql.database.azure.com:3306/A04

In [13]:
%%sql
ALTER TABLE a04.attributes
DROP PRIMARY KEY,
DROP COLUMN my_row_id,
MODIFY COLUMN business_id varchar(22) NOT NULL,
ADD PRIMARY KEY(business_id);

 * mysql://A04:***@testproject.mysql.database.azure.com:3306/A04
150346 rows affected.

[]

In [12]:
%%sql
ALTER TABLE a04.dietaryrestrictions
DROP PRIMARY KEY,
DROP COLUMN my_row_id,
MODIFY COLUMN business_id varchar(22) NOT NULL,
ADD PRIMARY KEY(business_id);

 * mysql://A04:***@testproject.mysql.database.azure.com:3306/A04
150346 rows affected.

[]

In [11]:
%%sql
ALTER TABLE a04.goodformeal
DROP PRIMARY KEY,
DROP COLUMN my_row_id,
MODIFY COLUMN business_id varchar(22) NOT NULL,
ADD PRIMARY KEY(business_id);

 * mysql://A04:***@testproject.mysql.database.azure.com:3306/A04
150346 rows affected.

[]

In [10]:
%%sql
ALTER TABLE a04.businessparking
DROP PRIMARY KEY,
DROP COLUMN my_row_id,
MODIFY COLUMN business_id varchar(22) NOT NULL,
ADD PRIMARY KEY(business_id);

 * mysql://A04:***@testproject.mysql.database.azure.com:3306/A04
150346 rows affected.

[]

In [9]:
%%sql
ALTER TABLE a04.ambience
DROP PRIMARY KEY,
DROP COLUMN my_row_id,
MODIFY COLUMN business_id varchar(22) NOT NULL,
ADD PRIMARY KEY(business_id);

 * mysql://A04:***@testproject.mysql.database.azure.com:3306/A04
150346 rows affected.

[]

In [8]:
%%sql
ALTER TABLE a04.music
DROP PRIMARY KEY,
DROP COLUMN my_row_id,
MODIFY COLUMN business_id varchar(22) NOT NULL,
ADD PRIMARY KEY(business_id);

 * mysql://A04:***@testproject.mysql.database.azure.com:3306/A04
150346 rows affected.

[]

In [7]:
%%sql
ALTER TABLE a04.bestnights
DROP PRIMARY KEY,
DROP COLUMN my_row_id,
MODIFY COLUMN business_id varchar(22) NOT NULL,
ADD PRIMARY KEY(business_id);

 * mysql://A04:***@testproject.mysql.database.azure.com:3306/A04
150346 rows affected.

[]

In [6]:
%%sql
ALTER TABLE a04.hairspecializesin
DROP PRIMARY KEY,
DROP COLUMN my_row_id,
MODIFY COLUMN business_id varchar(22) NOT NULL,
ADD PRIMARY KEY(business_id);

 * mysql://A04:***@testproject.mysql.database.azure.com:3306/A04
150346 rows affected.

[]

Queries

In [ ]:
#Understanding day based reviews to predict demand days
%%sql
SELECT DAYNAME(r.date) as day_of_week, COUNT(*) as total_reviews
FROM a04.business b
JOIN a04.review r ON b.business_id = r.business_id
JOIN a04.categories c ON c.business_id = b.index
WHERE b.city = 'Chicago' AND c.category IN ('Bars','Bakeries','Coffee & Tea','Coffee Roasteries','Desserts','Empanadas','Food','Food Stands','Food Tours','Food Trucks','Ice Cream & Frozen Yogurt','Indian','Kebab')
GROUP BY day_of_week
ORDER BY total_reviews DESC;

 * mysql://A04:***@testproject.mysql.database.azure.com:3306/A04

In [ ]:
#Top businesses by weighted average:
%%sql
WITH WeightedAvgRating AS (
SELECT business_id,
SUM(stars * review_count) / SUM(review_count) as weighted_avg_rating
FROM business
GROUP BY business_id)

SELECT b.name, war.weighted_avg_rating
FROM business b
JOIN WeightedAvgRating war ON b.business_id = war.business_id
ORDER BY war.weighted_avg_rating DESC
LIMIT 10;

 * mysql://A04:***@testproject.mysql.database.azure.com:3306/A04

In [ ]:
#Restaurants ratings over the years:
%%sql
SELECT b.name, YEAR(r.date) as review_year, AVG(r.stars) as avg_rating_per_year
FROM business b
JOIN review r ON b.business_id = r.business_id
GROUP BY b.name, review_year
ORDER BY review_year;

 * mysql://A04:***@testproject.mysql.database.azure.com:3306/A04

In [ ]:
#Average number of reviews per city:
%%sql
SELECT city, AVG(review_count) as avg_reviews_per_city
FROM (
  SELECT b.city, r.business_id, COUNT(*) as review_count
  FROM review r
  JOIN business b ON r.business_id = b.business_id
  GROUP BY b.city, r.business_id
) subquery
GROUP BY city
ORDER BY avg_reviews_per_city DESC;

 * mysql://A04:***@testproject.mysql.database.azure.com:3306/A04

In [ ]:
#Calculate the average ratings of restaurants:
%%sql
SELECT c.category as Category, AVG(stars) AS average_rating
FROM a04.business b
JOIN a04.categories c ON c.business_id = b.index
WHERE b.city = 'Chicago' and c.category in ('Bars','Bakeries','Coffee & Tea','Coffee Roasteries','Desserts','Empanadas','Food','Food Stands','Food Tours','Food Trucks','Ice Cream & Frozen Yogurt','Indian','Kebab','Restaurants')
GROUP BY c.category;

 * mysql://A04:***@testproject.mysql.database.azure.com:3306/A04

In [25]:
#Calculate the average pricing of restaurants:
%%sql
SELECT c.category as Category, MAX(a.RestaurantsPriceRange) as Max_Price, MIN(a.RestaurantsPriceRange) as Min_Price, AVG(a.RestaurantsPriceRange) as Avg_Price
FROM a04.business b
JOIN a04.attributes a ON a.business_id = b.business_id
JOIN a04.categories c ON c.business_id = b.business_id
WHERE b.city = 'Chicago' and c.category IN ('Bars','Bakeries','Coffee & Tea','Coffee Roasteries','Desserts','Empanadas','Food','Food Stands','Food Tours','Food Trucks','Ice Cream & Frozen Yogurt','Indian','Kebab','Restaurants')
GROUP BY c.category;

 * mysql://A04:***@testproject.mysql.database.azure.com:3306/A04
0 rows affected.

[]

In [27]:
#Analysis on pet friendliness :
%%sql
SELECT c.category as Category,
       SUM(CASE WHEN a.Dogs_Allowed = 'True' THEN 1 ELSE 0 END) as pet_friendly,
       (AVG(CASE WHEN a.Dogs_Allowed = 'True' THEN 1 ELSE 0 END) * 100) as percentage_pet_friendly
FROM a04.business b
JOIN a04.attributes a ON a.business_id = b.business_id
JOIN a04.categories c ON c.business_id = b.index
WHERE b.city = 'Chicago' and c.category in ('Bars','Bakeries','Coffee & Tea','Coffee Roasteries','Desserts','Empanadas','Food','Food Stands','Food Tours','Food Trucks','Ice Cream & Frozen Yogurt','Indian','Kebab','Restaurants')
GROUP BY c.category;

 * mysql://A04:***@testproject.mysql.database.azure.com:3306/A04

KeyboardInterrupt: ignored

In [29]:
#Distribution of ratings, looking at the number of restaurants that fall into different rating ranges
%%sql
	SELECT
    			CASE
        				WHEN stars >= 4.5 THEN 'Highly Rated (4.5 - 5)'
        				WHEN stars >= 3.5 THEN 'Moderately Rated (3.5 - 4.49)'
        				WHEN stars >= 2.5 THEN 'Average Rated (2.5 - 3.49)'
        				ELSE 'Low Rated (1 - 2.49)'
    			END AS rating_range,
    			COUNT(*) as business_count
FROM a04.business b
JOIN a04.attributes a ON a.business_id = b.business_id
JOIN a04.categories c ON c.business_id = b.index
where  b.city = 'Chicago' and c.category in ('Bars','Bakeries','Coffee & Tea','Coffee Roasteries','Desserts','Empanadas','Food','Food Stands','Food Tours','Food Trucks','Ice Cream & Frozen Yogurt','Indian','Kebab','Restaurants')
GROUP BY rating_range
ORDER BY rating_range;

 * mysql://A04:***@testproject.mysql.database.azure.com:3306/A04
0 rows affected.

[]

In [ ]:
#Places with the highest and lowest rating in each city:
%%sql
SELECT b.city, MIN(r.stars) as lowest_rating, MAX(r.stars) as highest_rating
FROM a04.business b
JOIN a04.review r ON b.business_id = r.business_id
GROUP BY b.city;

 * mysql://A04:***@testproject.mysql.database.azure.com:3306/A04

In [ ]:
#Exploring the average yelp ratings given to different categories
%%sql
SELECT c.category, AVG(r.stars) as avg_rating, COUNT(DISTINCT b.business_id) as business_count
FROM business b
JOIN review r ON b.business_id = r.business_id
JOIN categories c ON c.index = b.business_id
GROUP BY c.category
ORDER BY avg_rating DESC, business_count DESC;

 * mysql://A04:***@testproject.mysql.database.azure.com:3306/A04